# Data Integration
## 1. Data Merging

In [3]:
# Import libraries
import pandas as pd

# Example datasets fo merging
data1 ={
    'ID' : [1,2,3],
    'Name' : ['Alice', 'Bob', 'Charlie'],
    'Age' : [25,30,35]
}

# Convert data1 to DataFrame
df1 = pd.DataFrame(data1)

data2 = {
    'ID' : [1,2,4],
    'City' : ['New York', 'Los Angeles', 'Chicago'],
    'Salary' : [70000,80000,90000]
}

# Convert data2 to DataFrame
df2 = pd.DataFrame(data2)

# Merge datasets on 'ID' column
merged_df = pd.merge(df1, df2, on='ID', how='inner')

merged_df.head()

   ID   Name  Age         City  Salary
0   1  Alice   25     New York   70000
1   2    Bob   30  Los Angeles   80000

Output: Columns having same `ID` will merged. In the above datasets, only two ID's are same, so it merged only 2 records.

---
## 2. Concatenation

In [ ]:
# Import Libraries
import pandas as pd

# Example datasets for concatenation
data1 = {'Name' : ['Alice', 'Bob', 'Charlie'], 'Age' : [25,30,35]}
data2 = {'Name' : ['David', 'Eva', 'Frank'], 'Age' : [28,32,38]}
data3 = {'City' : ['New York', 'Los Angeles', 'Chicago'], 'Province' : ['NY', 'CA', 'IL']}

# Convert to DataFrames
df1 =pd.DataFrame(data1)
df2 =pd.DataFrame(data2)
df3 =pd.DataFrame(data3)

# Concatenate datasets vertically (row-wise)
concatenated_rows = pd.concat([df1, df2], axis=0)    # axis=0 is the default setting

# Concatenate datasets horizontally (column-wise)
concatenated_columns = pd.concat([df1, df3], axis=1)   # axis=1 for column-wise concatenation

print(concatenated_rows)
print('---------------------------------')
print(concatenated_columns)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
0    David   28
1      Eva   32
2    Frank   38
---------------------------------
      Name  Age         City Province
0    Alice   25     New York       NY
1      Bob   30  Los Angeles       CA
2  Charlie   35      Chicago       IL